toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
#include "System.h"
#include "Assert.h"
#include "SystemClock.h"
#include "Startup.h"
#include "MSP430.h"

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
static uint8_t _pixBuf0[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));
static uint8_t _pixBuf1[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));

using namespace STApp;

using EchoMsg = ICE40::EchoMsg;
using EchoResp = ICE40::EchoResp;
using SDClkSrcMsg = ICE40::SDClkSrcMsg;
using SDSendCmdMsg = ICE40::SDSendCmdMsg;
using SDGetStatusMsg = ICE40::SDGetStatusMsg;
using SDGetStatusResp = ICE40::SDGetStatusResp;
using PixResetMsg = ICE40::PixResetMsg;
using PixCaptureMsg = ICE40::PixCaptureMsg;
using PixReadoutMsg = ICE40::PixReadoutMsg;
using PixI2CTransactionMsg = ICE40::PixI2CTransactionMsg;
using PixI2CStatusMsg = ICE40::PixI2CStatusMsg;
using PixI2CStatusResp = ICE40::PixI2CStatusResp;
using PixCaptureStatusMsg = ICE40::PixCaptureStatusMsg;
using PixCaptureStatusResp = ICE40::PixCaptureStatusResp;

using SDRespTypes = ICE40::SDSendCmdMsg::RespTypes;
using SDDatInTypes = ICE40::SDSendCmdMsg::DatInTypes;

System::System() :
// QSPI clock divider=1 => run QSPI clock at 64 MHz
// QSPI alignment=word for high performance transfers
_qspi(QSPI::Mode::Dual, 1, QSPI::Align::Word),
_pixBufs(_pixBuf0, _pixBuf1) {
}

static QSPI_CommandTypeDef _ice40QSPICmd(const ICE40::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
    // When dual-flash quadspi is enabled, the supplied address is
    // divided by 2, so we left-shift `addr` in anticipation of that.
    // But by doing so, we throw out the high bit of `msg`, so we
    // require it to be 0.
    AssertArg(!(b[0] & 0x80));
    
    return QSPI_CommandTypeDef{
        .Instruction = 0xFF,
        .InstructionMode = QSPI_INSTRUCTION_4_LINES,
        
        // When dual-flash quadspi is enabled, the supplied address is
        // divided by 2, so we left-shift `addr` in anticipation of that.
        .Address = (
            (uint32_t)b[0]<<24  |
            (uint32_t)b[1]<<16  |
            (uint32_t)b[2]<<8   |
            (uint32_t)b[3]<<0
        ) << 1,
//            .Address = 0,
        .AddressSize = QSPI_ADDRESS_32_BITS,
        .AddressMode = QSPI_ADDRESS_4_LINES,
        
        .AlternateBytes = (
            (uint32_t)b[4]<<24  |
            (uint32_t)b[5]<<16  |
            (uint32_t)b[6]<<8   |
            (uint32_t)b[7]<<0
        ),
//            .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_32_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_4_LINES,
        
        .DummyCycles = 4,
        
        .NbData = (uint32_t)respLen,
        .DataMode = (respLen ? QSPI_DATA_4_LINES : QSPI_DATA_NONE),
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static void _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg) {
    qspi.command(_ice40QSPICmd(msg, 0));
    qspi.eventChannel.read(); // Wait for the transfer to complete
}

template <typename T>
static T _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg) {
    T resp;
    qspi.read(_ice40QSPICmd(msg, sizeof(resp)), &resp, sizeof(resp));
    qspi.eventChannel.read(); // Wait for the transfer to complete
    return resp;
}

static void _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg, void* resp, size_t respLen) {
    qspi.read(_ice40QSPICmd(msg, respLen), resp, respLen);
    qspi.eventChannel.read(); // Wait for the transfer to complete
}

static void _ice40TransferAsync(QSPI& qspi, const ICE40::Msg& msg, void* resp, size_t respLen) {
    qspi.read(_ice40QSPICmd(msg, respLen), resp, respLen);
}

// Test MSP430 FRAM writing
void System::init() {
    _super::init();
    _usb.init();
    _qspi.init();
    
    for (;; HAL_Delay(500)) {
        auto s = _msp.connect();
        if (s != _msp.Status::OK) {
            if (s == _msp.Status::JTAGDisabled) {
                s = _msp.erase();
                continue;
            } else {
                abort();
            }
        }
        
        constexpr uint32_t AddrStart = 0xE300;
        constexpr uint32_t AddrEnd = 0xFF80;
        constexpr uint32_t Len = (AddrEnd-AddrStart)/2; // Number of 16-bit words
        
//        const uint8_t testData[] = {0xCA, 0xFE, 0xBA, 0xBE, 0xFE, 0xED, 0xFA, 0xCE};
//        const uint8_t testData[] = {0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88};
        
        // Test reading
        {
            const uint8_t writeData[] = {0xCA, 0xFE, 0xBA, 0xBE, 0xFE, 0xED, 0xFA, 0xCE};
            uint8_t readData[sizeof(writeData)] = {};
            _msp.write(AddrStart, (uint16_t*)writeData, sizeof(writeData));
            
            {
                uint8_t tmp = 0;
                _msp.read(AddrStart, &tmp, 1);
                Assert(tmp == writeData[0]);
            }
            
            {
                uint8_t tmp = 0;
                _msp.read(AddrStart+1, &tmp, 1);
                Assert(tmp == writeData[1]);
            }
            
            
//            {
//                uint16_t val = 0;
//                _msp.read(0x0000, &val, 2);
//                
//                uint8_t b0;
//                _msp.read(0x0000, &b0, 1);
//                
//                uint8_t b1;
//                _msp.read(0x0001, &b1, 1);
//                
//                for (;;);
//            }

            {
                const uint8_t writeData[] = {0x42, 0x51};
                _msp.write(0xFFFE, (uint16_t*)writeData, sizeof(writeData));
                
                uint16_t val = 0;
                _msp.read(0xFFFE, &val, 2);
                
                uint8_t b0;
                _msp.read(0xFFFE, &b0, 1);
                
                uint8_t b1;
                _msp.read(0xFFFF, &b1, 1);
                
