toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
                for (;;);
            }
            
            
            
//            {
//                const uint8_t writeData[] = {0x42, 0x51};
//                _msp.write(0x1800, (uint16_t*)writeData, sizeof(writeData));
//                
//                uint16_t left = 0;
//                _msp.read(0x17FE, &left, 2);
//                
//                uint16_t right = 0;
//                _msp.read(0x1800, &right, 2);
//                
//                uint8_t bs[4] = {};
//                uint32_t addr = 0x17FE;
//                for (uint8_t& b : bs) {
//                    _msp.read(addr, &b, 1);
//                    addr++;
//                }
//                
//                for (;;);
//            }
            
            memset(readData, 0x42, sizeof(readData));
            _msp.read(AddrStart, readData, sizeof(readData));
            Assert(!memcmp(writeData, readData, sizeof(readData)));
            
            memset(readData, 0x42, sizeof(readData));
            _msp.read(AddrStart+1, readData, sizeof(readData)-1);
            Assert(!memcmp(writeData+1, readData, sizeof(readData)-1));
            Assert(readData[sizeof(readData)-1] == 0x42);
            
            memset(readData, 0x42, sizeof(readData));
            _msp.read(AddrStart+1, readData, sizeof(readData)-2);
            Assert(!memcmp(writeData+1, readData, sizeof(readData)-2));
            Assert(readData[sizeof(readData)-1] == 0x42);
            Assert(readData[sizeof(readData)-2] == 0x42);
            
            memset(readData, 0x42, sizeof(readData));
            _msp.read(AddrStart+1, readData+1, sizeof(readData)-2);
            Assert(!memcmp(writeData+1, readData+1, sizeof(readData)-2));
            Assert(readData[0] == 0x42);
            Assert(readData[sizeof(readData)-1] == 0x42);
        }
        
        // Test writing
        {
            const uint8_t writeData[] = {0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88};
            uint8_t readData[sizeof(writeData)] = {};
            _msp.write(AddrStart, (uint16_t*)writeData, sizeof(writeData));
            
            memset(readData, 0x42, sizeof(readData));
            _msp.read(AddrStart, readData, sizeof(readData));
            Assert(!memcmp(writeData, readData, sizeof(readData)));
            
            const uint8_t writeData2[] = {0xCA, 0xFE, 0xBA, 0xBE, 0xFE, 0xED, 0xFA, 0xCE};
            memset(readData, 0x42, sizeof(readData));
            _msp.write(AddrStart+1, (uint16_t*)writeData2, sizeof(writeData2)-1);
            _msp.read(AddrStart+1, readData, sizeof(readData)-1);
            Assert(!memcmp(writeData2, readData, sizeof(readData)-1));
            
            const uint8_t writeData3[] = {0xBB, 0xAA, 0xAA, 0xDD, 0xBB, 0xEE, 0xEE, 0xFF};
            memset(readData, 0x42, sizeof(readData));
            _msp.write(AddrStart+1, (uint16_t*)writeData3+1, sizeof(writeData3)-2);
            _msp.read(AddrStart+1, readData, sizeof(readData)-2);
            Assert(!memcmp(writeData3+1, readData, sizeof(readData)-2));
        }
        
        _msp.disconnect();
    }
}

//// Test MSP430 RAM/FRAM writing
//void System::init() {
//    _super::init();
//    _usb.init();
//    _qspi.init();
//    
//    for (bool x=true;; x=!x) {
//        _LED0::Write(x);
//        _LED1::Write(x);
//        _LED2::Write(!x);
//        _LED3::Write(!x);
//        HAL_Delay(500);
//    }
//    
//    // Turn on the IMG rails (VDD_2V8_IMG and VDD_1V9_IMG) by telling MSP430
//    // to drive VDD_2V8_IMG_EN / VDD_1V9_IMG_EN high
//    {
//        constexpr uint16_t PM5CTL0          = 0x0130;
//        constexpr uint16_t PAOUT            = 0x0202;
//        constexpr uint16_t PADIR            = 0x0204;
//        constexpr uint16_t PAREN            = 0x0206;
//        constexpr uint16_t PASEL0           = 0x020A;
//        constexpr uint16_t PASEL1           = 0x020C;
//        
//        constexpr uint16_t VDD_1V9_IMG_EN   = 1<<0;
//        constexpr uint16_t VDD_2V8_IMG_EN   = 1<<2;
//        
//        auto s = _msp.connect();
//        if (s != _msp.Status::OK) {
//            abort();
//        }
//        
//        // Clear LOCKLPM5 in the PM5CTL0 register
//        // This is necessary to be able to control the GPIOs
//        _msp.write(PM5CTL0, 0x0010);
//        
//        // Clear PAOUT so everything is driven to 0 by default
//        _msp.write(PAOUT, 0x0000);
//        
//        // Make VDD_2V8_IMG_EN / VDD_1V9_IMG_EN outputs
//        _msp.write(PADIR, VDD_2V8_IMG_EN|VDD_1V9_IMG_EN);
//        
//        // Turn on VDD_2V8_IMG_EN
//        _msp.write(PAOUT, VDD_2V8_IMG_EN);
//        HAL_Delay(10);
//        
//        // Turn on VDD_1V9_IMG_EN
//        _msp.write(PAOUT, VDD_2V8_IMG_EN|VDD_1V9_IMG_EN);
//    }
//}


//template <typename MSP>
//void _testFRAMWrite(MSP msp) {
//    constexpr uint32_t AddrStart = 0xE300;
//    constexpr uint32_t AddrEnd = 0xFF80;
//    constexpr uint32_t Len = (AddrEnd-AddrStart)/2; // Number of 16-bit words
//    
//    msp.crcReset();
//    msp.framWrite(AddrStart, (uint16_t*)(0x00200000), Len);
//    
//    auto s = msp.crcVerify(AddrStart, Len);
//    if (s != MSP::Status::OK) {
//        abort();
//    }
//}
//
//template <typename MSP>
//void _testRAMWrite(MSP msp) {
//    constexpr uint32_t AddrStart = 0x2000;
//    constexpr uint32_t AddrEnd = 0x2800;
//    constexpr uint32_t Len = (AddrEnd-AddrStart)/2; // Number of 16-bit words
//    
//    msp.crcReset();
//    msp.write(AddrStart, (uint16_t*)(0x00200000), Len);
//    
//    auto s = msp.crcVerify(AddrStart, Len);
//    if (s != MSP::Status::OK) {
//        abort();
//    }
//}
//
//// Test MSP430 RAM/FRAM writing
//void System::init() {
//    _super::init();
//    _usb.init();
//    _qspi.init();
//    
//    for (;; HAL_Delay(500)) {
//        auto s = _msp.connect();
//        if (s != _msp.Status::OK) {
//            if (s == _msp.Status::JTAGDisabled) {
//                s = _msp.erase();
//                continue;
//            } else {
//                abort();
//            }
//        }
//        
//        _testRAMWrite(_msp);
//        _testRAMWrite(_msp);
//        
//        _testRAMWrite(_msp);
//        _testFRAMWrite(_msp);
//        
//        _testFRAMWrite(_msp);
//        _testRAMWrite(_msp);
//        
//        _testFRAMWrite(_msp);
//        _testFRAMWrite(_msp);
//        
//        _msp.disconnect();
//    }
//}


//// Test MSP430 FRAM writing
//void System::init() {
//    _super::init();
//    _usb.init();
//    _qspi.init();
//    
//    for (;; HAL_Delay(500)) {
//        auto s = _msp.connect();
//        if (s != _msp.Status::OK) {
//            if (s == _msp.Status::JTAGDisabled) {
//                s = _msp.erase();
//                continue;
//            } else {
//                abort();
//            }
//        }
//        
//        constexpr uint32_t AddrStart = 0xE300;
//        constexpr uint32_t AddrEnd = 0xFF80;
//        constexpr uint32_t Len = (AddrEnd-AddrStart)/2; // Number of 16-bit words
//        
//        _msp.crcReset();
//        _msp.framWrite(AddrStart, (uint16_t*)(0x20010000), Len);
//        
//        s = _msp.crcVerify(AddrStart, Len);
//        if (s != _msp.Status::OK) {
//            abort();
//        }
//        
//        _msp.disconnect();
//    }
//}



//// Test MSP430 RAM writing
//void System::init() {
//    _super::init();
//    _usb.init();
//    _qspi.init();
//    
//    for (;; HAL_Delay(500)) {
//        auto s = _msp.connect();
//        if (s != _msp.Status::OK) {
//            if (s == _msp.Status::JTAGDisabled) {
//                s = _msp.erase();
//                continue;
//            } else {
//                abort();
//            }
//        }
//        
//        constexpr uint32_t AddrStart = 0x2000;
//        constexpr uint32_t AddrEnd = 0x2800;
//        constexpr uint32_t Len = (AddrEnd-AddrStart)/2; // Number of 16-bit words
//        
//        _msp.crcReset();
//        _msp.write(AddrStart, (uint16_t*)(0x20010000), Len);
//        
////        uint16_t* stmAddr = (uint16_t*)0x20010000;
////        uint32_t mspAddr = AddrStart;
////
////        const uint16_t expected = *stmAddr;
////        uint16_t got1 = 0;
////        _msp.read(mspAddr, &got1, 1);
////
////        uint16_t got2 = 0;
////        got2 = _msp.read(mspAddr);
////
////        _msp.crcReset();
////        _msp.framWrite(AddrStart, (uint16_t*)(0x20010000), 1);
////        
////        for (uint32_t i=0; i<Len; i++) {
////            const uint16_t expected = *stmAddr;
////            uint16_t got1 = 0;
////            _msp.read(mspAddr, &got1, 1);
////            
////            uint16_t got2 = 0;
////            got2 = _msp.read(mspAddr);
////            
////            if (expected != got1) {
////                abort();
////            }
////            
////            if (expected != got2) {
////                abort();
////            }
////            
////            stmAddr++;
////            mspAddr+=2;
////        }
//        
//        s = _msp.crcVerify(AddrStart, Len);
//        if (s != _msp.Status::OK) {
//            abort();
//        }
//        
//        _msp.disconnect();
//    }
//}

